
def area(a):
    """
    Вычисляет площадь квадрата по длине его стороны. S = a²

    Параметры:
        a (int | float): длина стороны квадрата.
    Возвращает:
        int | float: площадь квадрата.
    Пример:
        area(5) ---> 25
    """

    return a * a


def perimeter(a):
    """
    Вычисляет периметр квадрата по длине его стороны. P = 4a

    Параметры:
        a (int | float): длина стороны квадрата.
    Возвращает:
        int | float: периметр квадрата.
    Пример:
        perimeter(5) ---> 20
    """

    return 4 * a
